## `¿ Qué es un DataFrame ?`

* Un DataFrame es un conjunto de datos con estructura Matricial, formado por Filas y Columnas.
* Se puede Definir como un conjunto de Series que comparten un Indice
* Puede Almacenar Cualquier Tipo de Dato

## `¿ Qué se puede hacer con un DataFrame ?`

* Agruparlos por valores de columnas
* Calcular Sumas, medias, medianas, maximos, minimos, etc.
* Seleccionar Filas, Columnas con ciertos valores
* Concatenar, mezclar combinar varis DataFrames

## `Ejercicio 1`

Primer Forma de construir un DataFrame con datos y columnas

In [1]:
import pandas as pd

mes_ventas = pd.DataFrame(data=[
    ('Enero', 177643, 12475, 996, 2564),
    ('Febrero', 177643, 54321, 236, 4325),
    ('Marzo', 177643, 98654, 567, 7654),
    ('Abril', 177643, 34986, 123, 9876),
    ('Mayo', 177643, 345123, 890, 7890),
   
], columns=['Mes', 'Ventas', 'Gastos', 'Ingresos', 'Utilidades'])

mes_ventas

       Mes  Ventas  Gastos  Ingresos  Utilidades
0    Enero  177643   12475       996        2564
1  Febrero  177643   54321       236        4325
2    Marzo  177643   98654       567        7654
3    Abril  177643   34986       123        9876
4     Mayo  177643  345123       890        7890

## `Ejercicio 2`

Segunda Forma de construir un DataFrame con diccionarios

In [5]:
personas = pd.DataFrame({
    'Nombre': ['Juan', 'María', 'Pedro', 'Ana'],
    'Edad': [25, 30, 35, 40],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Sevilla']
})

personas

  Nombre  Edad     Ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35   Valencia
3    Ana    40    Sevilla

## `Ejercicio 3`

Devolver el numero de Filas que tiene un DataFrame

In [6]:
len(personas)

4

## `Ejercicio 4`

Obtener los valores del DataFrame

In [7]:
personas.values

array([['Juan', 25, 'Madrid'],
       ['María', 30, 'Barcelona'],
       ['Pedro', 35, 'Valencia'],
       ['Ana', 40, 'Sevilla']], dtype=object)

## `Ejercicio 5`

Obtener las columnas del DataFrame

In [8]:
personas.columns

Index(['Nombre', 'Edad', 'Ciudad'], dtype='object')

## `Ejercicio 6`

Muestra calculos

In [9]:
personas.describe()

            Edad
count   4.000000
mean   32.500000
std     6.454972
min    25.000000
25%    28.750000
50%    32.500000
75%    36.250000
max    40.000000

## `Ejercicio 7`

Mostrar Información de las columnas

In [10]:
personas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Nombre  4 non-null      object
 1   Edad    4 non-null      int64
 2   Ciudad  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes